Revit.Elements.FamilyInstance.Type
Gets family type of the specific family instance
symbol

Revit.Elements.FamilyInstance.ByPoint(Revit.Elements.FamilyType,Autodesk.DesignScript.Geometry.Point)
Place a Revit FamilyInstance given the FamilyType (also known as the FamilySymbol in the Revit API) and its coordinates in world space
familyType: Family Type. Also called Family Symbol.
point: Point in meters.
Returns:

Revit.Elements.FamilyInstance.ByFace(Revit.Elements.FamilyType,Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.Line)
Place a Revit family instance of the given the FamilyType (also known as the FamilySymbol in the Revit API)
on a surface derived from a backing Revit face as reference and a line as reference for its position.
Note: The FamilyPlacementType must be CurveBased and the input surface must be created from a Revit Face
familyType: Family Type. Also called Family Symbol.
face: Surface geometry derived from a Revit face as reference element
line: A line on the face defining where the symbol is to be placed
Returns: FamilyInstance

Revit.Elements.FamilyInstance.ByFace(Revit.Elements.FamilyType,Autodesk.DesignScript.Geometry.Surface,Autodesk.DesignScript.Geometry.Point,Autodesk.DesignScript.Geometry.Vector)
Place a Revit family instance given the FamilyType (also known as the FamilySymbol in the Revit API)
on a surface derived from a backing Revit face as reference, a reference direction and a point location where to place the family.
Note: The FamilyType should be workplane based and the input surface must be created from a Revit Face. The reference direction defines the rotation of the instance on the reference, and thus cannot be perpendicular to the face.
familyType: Family Type. Also called Family Symbol.
face: Surface geometry derived from a Revit face as reference element
location: Point on the face where the instance is to be placed
referenceDirection: A vector that defines the direction of placement of the family instance
Returns: FamilyInstance

Revit.Elements.FamilyInstance.ByCoordinates(Revit.Elements.FamilyType,System.Double,System.Double,System.Double)
Place a Revit FamilyInstance given the FamilyType (also known as the FamilySymbol in the Revit API) and its coordinates in world space
familyType: Family Type. Also called Family Symbol.
x: X coordinate in meters
y: Y coordinate in meters
z: Z coordinate in meters
Returns:

Revit.Elements.FamilyInstance.ByPointAndLevel(Revit.Elements.FamilyType,Autodesk.DesignScript.Geometry.Point,Revit.Elements.Level)
Place a Revit FamilyInstance given the FamilyType (also known as the FamilySymbol in the Revit API), it's coordinates in world space, and the Level
familyType: Family Type. Also called Family Symbol.
point: Point in meters.
level: Level to host Family Instance.
Returns:

Revit.Elements.FamilyInstance.ByFamilyType(Revit.Elements.FamilyType)
Obtain a collection of FamilyInstances from the Revit Document and use them in the Dynamo graph
familyType: Family Type. Also called Family Symbol.
Returns:
byfamilysymbol,ByFamilySymbol

Revit.Elements.FamilyInstance.GetHost
Gets the host of this fmaily instance (if any). Eg. returns the wall of a window or door family instance.

Revit.Elements.FamilyInstance.GetFamily
Gets the family of this family instance

Revit.Elements.FamilyInstance.GetType
Gets the family type of this family instance

Revit.Elements.FamilyInstance.SetRotation(System.Double)
Set the Euler angle of the family instance around its local Z-axis.
degree: The Euler angle around Z-axis.
Returns: The result family instance.

Revit.Elements.FamilyInstance.InternalGetTransform
Get the transform of the internal family instance
Returns: The internal transform